testdata/requests/owa_deletefolder_request.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:t="http://schemas.microsoft.com/exchange/services/2006/types" xmlns:m="http://schemas.microsoft.com/exchange/services/2006/messages">
    <soap:Header>
        <t:RequestServerVersion Version="Exchange2013"/>
        <t:TimeZoneContext>
            <t:TimeZoneDefinition Id="Eastern Standard Time"/>
        </t:TimeZoneContext>
    </soap:Header>
    <soap:Body>
        <m:DeleteFolder DeleteType="MoveToDeletedItems">
            <m:FolderIds>
                <t:FolderId Id="AAAA=="/>
            </m:FolderIds>
        </m:DeleteFolder>
    </soap:Body>
</soap:Envelope>